In [ ]:
import random

In [1]:
import pandas as pd
import mysql.connector
from sqlalchemy import create_engine

In [7]:
df = pd.read_csv('/home/mubeen/Documents/data.csv')

In [8]:
df.head()

    Students  Marks
0  Student-1      1
1  Student-2     93
2  Student-3     57
3  Student-4     26
4  Student-5      7

In [32]:
def marks_to_cgpa(marks):
    marks = marks['Marks']
    if marks >= 90:
        return 4.0
    elif marks >= 80:
        return 3.7
    elif marks >= 70:
        return 3.3
    elif marks >= 60:
        return 3.0
    elif marks >= 50:
        return 2.7
    elif marks >= 40:
        return 2.3
    elif marks >= 30:
        return 2.2

    elif marks >= 20:
        return 2.1
    elif marks >= 10:
        return 1.1
    else:
        return 0.0

In [39]:
df['cgpa'] = df.apply(marks_to_cgpa,axis=1)

In [40]:
df

        Students  Marks  cgpa
0      Student-1      1   0.0
1      Student-2     93   4.0
2      Student-3     57   2.7
3      Student-4     26   2.1
4      Student-5      7   0.0
..           ...    ...   ...
295  Student-296     24   2.1
296  Student-297     15   1.1
297  Student-298      2   0.0
298  Student-299     12   1.1
299  Student-300     40   2.3

[300 rows x 3 columns]

In [41]:
mysql_config = {
    'host': 'localhost',
    'port': '3307',  
    'user': 'root',
    'password': '',
    'database': 'win'
}

In [5]:
def dataframe_to_mysql(df, table_name, mysql_config):
    conn = mysql.connector.connect(**mysql_config)
    engine = create_engine(f"mysql+mysqlconnector://{mysql_config['user']}:{mysql_config['password']}@{mysql_config['host']}:{mysql_config['port']}/{mysql_config['database']}")

    conn.connect()
    cursor = conn.cursor()
    cursor.execute('SET GLOBAL max_allowed_packet = 1024 * 1024 * 80;')
    cursor.execute('SET GLOBAL max_heap_table_size = 1024 * 1024 * 80;')


    
    df.to_sql(name=table_name, con=engine, index=False, if_exists='replace')
    # query = f'SELECT * FROM {table_name};'
    # result_df = pd.read_sql(query, con=engine)

In [9]:
import os
for i in os.listdir(path):   
    f_p = os.path.join(path,i)
    df = pd.read_csv(f_p)
    dataframe_to_mysql(df, i.split('.')[0], mysql_config)

NameError: name 'path' is not defined

In [42]:
dataframe_to_mysql(df, 'std', mysql_config)